Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.Delete Method
 Delete analysis results by the given key.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool Delete(
	AnalysisResult.ObjectTypeEnum objectType,
	int objectId
)
Public Shared Function Delete (
	objectType As AnalysisResult.ObjectTypeEnum,
	objectId As Integer
) As Boolean
Parameters
objectType
Type: Tekla.Structures.Analysis.AnalysisResult.ObjectTypeEnum
Object type.
objectId
Type: System.Int32
Object id.
Return Value
Type: Boolean
True if successful.
Examples
 Delete all analysis results of part.
var result = AnalysisResult.Delete(AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_PART, analysisPart.PartID.ID);
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace